# pandas
It provides two primary data structures: Series ans Data Frame

In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mmond\venv\lib\site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mmond\venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\mmond\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
    --------------------------------------- 0.3/11.5 MB ? eta -:--:--
    --------------------------------------- 0.3/11.5 MB ? eta -:--:--
    --------------------------------------- 0.3/11.5 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   - -------------------------------------- 0.5/11.5 MB 342.2 kB/s eta 0:00:33
   -- ------------------------------------- 0.8/11.5 MB 202.1 kB/s eta 0:00:54
   -- ------------------------------------- 0.8/11.5 MB 202.1 kB/s eta 0:00:54
   --- ------------------------------------ 1.0/11.5 MB 255.5 kB/s eta 0:00:41
   ---- ----------------------------------- 1.3/11.5 MB 322.6 kB/s eta 0:00:32
   ----- ---------------------------------- 1.6/11.5 MB 371.1 kB/s eta 0:00:27
   ------ --------------------------------- 1.8/11.5 MB 410.9 kB/s eta 0:00:24
   ------- -------------------------------- 2.1/11.5 MB 456.9 kB/s eta 0:00:21
   -------- ------------------------------- 2.4/11.5 MB 497.1 kB/s eta 0:00:19
   --------- ------------------------------ 2.6/11.5 MB 541.1 kB/s eta 0:00:17
   ---------- ----------------------------- 2.9/11.5 MB 564.8 kB/s eta 0:00:16
   ---------- ----------------------------- 3.1/11.5 MB 595.3 kB/s eta 0:00:15
   ----------- ---------------------------- 3.4/11.5 MB 623.3 kB/s eta 0:00:13
   ------------ --------------------------- 3.7/11.5 MB 647.1 kB/s eta 0:00:13
   ------------- -------------------------- 3.9/11.5 MB 659.7 kB/s eta 0:00:12
   -------------- ------------------------- 4.2/11.5 MB 691.3 kB/s eta 0:00:11
   --------------- ------------------------ 4.5/11.5 MB 712.0 kB/s eta 0:00:10
   ---------------- ----------------------- 4.7/11.5 MB 733.2 kB/s eta 0:00:10
   ----------------- ---------------------- 5.0/11.5 MB 740.2 kB/s eta 0:00:09
   ------------------ --------------------- 5.2/11.5 MB 764.4 kB/s eta 0:00:09
   ------------------- -------------------- 5.5/11.5 MB 782.2 kB/s eta 0:00:08
   -------------------- ------------------- 5.8/11.5 MB 797.0 kB/s eta 0:00:08
   -------------------- ------------------- 6.0/11.5 MB 813.0 kB/s eta 0:00:07
   --------------------- ------------------ 6.3/11.5 MB 814.0 kB/s eta 0:00:07
   ---------------------- ----------------- 6.6/11.5 MB 833.6 kB/s eta 0:00:06
   ----------------------- ---------------- 6.8/11.5 MB 849.0 kB/s eta 0:00:06
   ------------------------ --------------- 7.1/11.5 MB 847.0 kB/s eta 0:00:06
   ------------------------- -------------- 7.3/11.5 MB 859.5 kB/s eta 0:00:05
   -------------------------- ------------- 7.6/11.5 MB 869.9 kB/s eta 0:00:05
   --------------------------- ------------ 7.9/11.5 MB 876.6 kB/s eta 0:00:05
   ---------------------------- ----------- 8.1/11.5 MB 879.9 kB/s eta 0:00:04
   ---------------------------- ----------- 8.1/11.5 MB 879.9 kB/s eta 0:00:04
   ---------------------------- ----------- 8.1/11.5 MB 879.9 kB/s eta 0:00:04
   ---------------------------- ----------- 8.1/11.5 MB 879.9 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ----------------------------- ---------- 8.4/11.5 MB 834.8 kB/s eta 0:00:04
   ------------------------------ --------- 8.7/11.5 MB 716.8 kB/s eta 0:00:04
   ------------------------------ --------- 8.7/11.5 MB 716.8 kB/s eta 0:00:04
   ------------------------------ --------- 8.7/11.5 MB 716.8 kB/s eta 0:00:04
   ------------------------------ --------- 8.7/11.5 MB 716.8 kB/s eta 0:00:04
   ------------------------------ --------- 8.9/11.5 MB 692.1 kB/s eta 0:00:04
   ------------------------------- -------- 9.2/11.5 MB 700.8 kB/s eta 0:00:04
   -------------------------------- ------- 9.4/11.5 MB 709.2 kB/s eta 0:00:03
   --------------------------------- ------ 9.7/11.5 MB 713.9 kB/s eta 0:00:03
   --------------------------------- ------ 9.7/11.5 MB 713.9 kB/s eta 0:00:03
   --------------------------------- ------ 9.7/11.5 MB 713.9 kB/s eta 0:00:03
   ---------------------------------- ----- 10.0/11.5 MB 705.4 kB/s eta 0:00:03
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 713.1 kB/s eta 0:00:02
   ------------------------------------ --- 10.5/11.5 MB 603.1 kB/s eta 0:00:02
   ------------------------------------ --- 10.5/11.5 MB 603.1 kB/s eta 0:00:02
   ------------------------------------- -- 10.7/11.5 MB 600.2 kB/s eta 0:00:02
   ------------------------------------- -- 10.7/11.5 MB 600.2 kB/s eta 0:00:02
   -------------------------------------- - 11.0/11.5 MB 601.8 kB/s eta 0:00:01
   -------------------------------------- - 11.0/11.5 MB 601.8 kB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 605.3 kB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 610.8 kB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

# Series
A panda series is a one dimensional array-like object that can hold any dtaa type. It is similar tot a column in a table.

In [6]:
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series: \n",series)

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64

Creat a series from dictionary

In [7]:
data={'a':1,'b':2,'c':3}
series_data=pd.Series(data)
print(series_data)

a    1
b    2
c    3
dtype: int64

In [8]:
data=[10,20,30]
index=['a','b','c']
seris=pd.Series(data,index=index)
print(seris)

a    10
b    20
c    30
dtype: int64

# Dataframe
create a dataframe from a dictionary of list

In [5]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
data_frame=pd.DataFrame(data)
print(data_frame)

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

In [6]:
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series: \n",series)

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64

Create a dataframe from a list of dictionaries

In [7]:
data=[{'name':'Istiak','age':25,'city':'Dhaka'},
       {'name':'John','age':27,'city':'Dinazpur'},
       {'name':'Jack','age':28,'city':'Germany'}
    ]
df=pd.DataFrame(data)
print(type(data))
print(df)

<class 'list'>
     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

# Reading from csv file

In [ ]:
df=pd.read_csv('sales_data.csv')
print(df)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

First 5 lines from the csv file

In [11]:
df=pd.read_csv('sales_data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

Last 5 lines from the csv file

In [15]:
df=pd.read_csv('sales_data.csv')
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

Accessing data from dataframe

In [12]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
print(df)
print()
print(df['name'])

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

0    Istiak
1      John
2      Jack
Name: name, dtype: object

df.loc [ ] Operation

In [13]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
print(df)
print()
print(df.loc[1])
print()
df.loc[0][2]

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

name        John
age           27
city    Dinazpur
Name: 1, dtype: object

C:\Users\mmond\AppData\Local\Temp\ipykernel_16892\3609176066.py:10: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][2]

'Dhaka'

df.iloc [ ] Operation

In [52]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
print(df)
print()
print(df.iloc[1])
print()
df.iloc[1][2]

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

name        John
age           27
city    Dinazpur
Name: 1, dtype: object

C:\Users\mmond\AppData\Local\Temp\ipykernel_6460\3925078486.py:10: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][2]

'Dinazpur'

Accessing a specified element using "df.at [ int, 'attribute' ]"

In [58]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
print(df)
print()
print(df.at[2,'city'])
print()
print(print(df.at[1,'age']))

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

Germany

27
None

Accessing a specified element using "df.iat [ int, int ]"

In [60]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
print(df)
print()
print(df.iat[2,2])
print()
print(print(df.iat[1,0]))

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

Germany

John
None

# Data Manipulation
Adding a column

In [89]:
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
df['salary']=[20000,30000,50000]
df

     name  age      city  salary
0  Istiak   25     Dhaka   20000
1    John   27  Dinazpur   30000
2    Jack   28   Germany   50000

It drops a column temporarily by using "df.drop('obg',axis=int)"

In [ ]:
df.drop('salary',axis=1)

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

In [91]:
df

     name  age      city  salary
0  Istiak   25     Dhaka   20000
1    John   27  Dinazpur   30000
2    Jack   28   Germany   50000

Parmanently drop the column by using "df.drop('obg',axis=int, inplace=True)"

In [ ]:
df.drop('salary',axis=1,inplace=True)
df

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

Show the data types

In [100]:
df.dtypes

name    object
age      int64
city    object
dtype: object

It describe the statistical summery

In [101]:
df.describe()

             age
count   3.000000
mean   27.666667
std     1.527525
min    26.000000
25%    27.000000
50%    28.000000
75%    28.500000
max    29.000000

# Practice on Data Manipulation
Incrementing all the age by 1

In [3]:
import pandas as pd
data={'name':['Istiak','John','Jack'],
      'age':[25,27,28],
      'city':['Dhaka','Dinazpur','Germany']
      }
df=pd.DataFrame(data)
print(df)
print()
print("After Incrementing age by 1 year")
df['age']=df['age']+1
print(df)
print("Data Summary:\n")
print(df.describe())

     name  age      city
0  Istiak   25     Dhaka
1    John   27  Dinazpur
2    Jack   28   Germany

After Incrementing age by 1 year
     name  age      city
0  Istiak   26     Dhaka
1    John   28  Dinazpur
2    Jack   29   Germany
Data Summary:

             age
count   3.000000
mean   27.666667
std     1.527525
min    26.000000
25%    27.000000
50%    28.000000
75%    28.500000
max    29.000000

# Practice on a .csv file for data manipulation using Pandas

Read the .csv file

In [4]:
import pandas as pd
df=pd.read_csv('sales_data.csv')
# Fetch the first five rows
df.head(5)
# Fetch the Last five rows
df.tail(5)
#Statistical Summary
df.describe()
#Data Types
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

Handling missing values

In [ ]:
df.isnull() #Check whether there is any missing values or not?

In [20]:
df.isnull().any(axis=0)

Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool

In [21]:
df.isnull().sum(axis=0)

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

Filling out the missing values

In [ ]:
df.fillna(0) #It will fill all the missing value with 0's
df_filled=df.fillna(0) #Should create another copy of this filled dataframe

Drop rows with null values

In [ ]:
df = df.dropna()

Check for duplicates

In [ ]:
print(df.duplicated().sum())

Remove duplicates

In [ ]:
df = df.drop_duplicates()

*Most of time we actually filled missing values with the 'mean value' of that particular columns*

In [6]:
df['sales_fillna']=df['Sales'].fillna(df['Sales'].mean())
df.head(5)

         Date Category  Value   Product  Sales Region  sales_fillna
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

Rename an existing column "df= df.rename(column={"x_name, new_name"})"

In [7]:
df=df.rename(columns={'Date':'Dates'})
df.head(5)

        Dates Category  Value   Product  Sales Region  sales_fillna
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

Changing data types "astype()"

In [8]:
df['new_value']=df['Value'].fillna(df['Value'].mean()).astype(int)
df.head(5)

        Dates Category  Value   Product  Sales Region  sales_fillna  new_value
0  2023-01-01        A   28.0  Product1  754.0   East         754.0         28
1  2023-01-02        B   39.0  Product3  110.0  North         110.0         39
2  2023-01-03        C   32.0  Product2  398.0   East         398.0         32
3  2023-01-04        B    8.0  Product1  522.0   East         522.0          8
4  2023-01-05        B   26.0  Product3  869.0  North         869.0         26

Applying operation on a specific column by using "apply ( )"

In [11]:
df['increased_value']=df['Value'].fillna(df['Value'].mean()).apply(lambda x:x*2).astype(int)
df.head(5)

,Dates,Category,Value,Product,Sales,Region,sales_fillna,new_value,increased_value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,56
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,78
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32,64
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8,16
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26,52

No. of product in the dataset

In [18]:
df['Product'].value_counts()

Product
Product3    19
Product1    16
Product2    15
Name: count, dtype: int64

# Data Aggregating and Gouping

In [29]:
df.head()

,Dates,Category,Value,Product,Sales,Region,sales_fillna,new_value,increased_value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,56
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,78
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32,64
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8,16
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26,52

Based on product, I want to do an aggerigation and i want to de the mean of the specific value. "df.groupby('base_col)['target_col].mean()

In [35]:
grouped_mean=df.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Product1    46.214286
Product2    52.800000
Product3    55.166667
Name: Value, dtype: float64

Based on 2 or multiple catagories "product and Region" i want to do an aggerigation and i want to do the sum of the specific "value". "df.groupby(['base_col_ 1','base_col_ 2','base_col_ n'])['target_col].sum()

In [61]:
gouped_sum=df.groupby(['Product','Region'])['Value'].sum()
gouped_sum

Product   Region
Product1  East      292.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     203.0
          South     215.0
          West      373.0
Name: Value, dtype: float64

aggrigate Multiple functions

In [ ]:
gouped_aggri=df.groupby('Region')['Sales'].agg(['sum','mean','count'])
gouped_aggri

           sum       mean  count
Region
East     550.0  42.307692     13
North    339.0  37.666667      9
South    496.0  62.000000      8
West    1047.0  61.588235     17

# Merging and joining dataframes

Creating sample dataframes

In [36]:
df1=pd.DataFrame({'key':['a','b','c'], 'value1':[10,20,30]})

df2=pd.DataFrame({'key': ['a','d','b'], 'value2':[40,50,60]})

In [37]:
df1

  key  value1
0   a      10
1   b      20
2   c      30

In [38]:
df2

  key  value2
0   a      40
1   d      50
2   b      60

Merge Dataframe based on the "Key" column (inner join)

In [39]:
pd.merge(df1,df2,on='key', how='inner')

  key  value1  value2
0   a      10      40
1   b      20      60

Merge Dataframe based on the "Key" column (outer join)

In [40]:
pd.merge(df1,df2,on='key',how='outer')

  key  value1  value2
0   a    10.0    40.0
1   b    20.0    60.0
2   c    30.0     NaN
3   d     NaN    50.0

Merge Dataframe based on the "Key" column (left join)

In [41]:
pd.merge(df1,df2,on='key',how='left')

  key  value1  value2
0   a      10    40.0
1   b      20    60.0
2   c      30     NaN

Merge Dataframe based on the "Key" column (right join)

In [42]:
pd.merge(df1,df2,on='key',how='right')

  key  value1  value2
0   a    10.0      40
1   d     NaN      50
2   b    20.0      60